Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E16C.xml
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x400B4000"/>
            <signals>
              <signal pad="PB2" function="X1" group="AFE1_AD" index="0"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AFE1_AD" index="1"/>
              <signal pad="PA21" function="X1" group="AFE1_AD" index="2"/>
              <signal pad="PA22" function="X1" group="AFE1_AD" index="3"/>
              <signal pad="PC1" function="X1" group="AFE1_AD" index="4"/>
              <signal pad="PC2" function="X1" group="AFE1_AD" index="5"/>
              <signal pad="PC3" function="X1" group="AFE1_AD" index="6"/>
              <signal pad="PC4" function="X1" group="AFE1_AD" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="CAN" version="6019P">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0x40010000"/>
            <signals>
              <signal pad="PB3" function="A" group="CANRX" index="0"/>
              <signal pad="PB2" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417S">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" version="11108C">
          <instance name="CMCC">
            <register-group address-space="base" name="CMCC" name-in-module="CMCC" offset="0x400C4000"/>
          </instance>
        </module>
        <module name="DACC" version="6461K">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x400B8000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PB14" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" version="6233P">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400C0000"/>
          </instance>
        </module>
        <module name="EFC" version="6450N">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" version="11046F">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40034000"/>
            <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD4" function="A" group="GCRSDV"/>
              <signal pad="PD4" function="A" group="GRXDV"/>
              <signal pad="PD8" function="A" group="GMDC"/>
              <signal pad="PD9" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD7" function="A" group="GRXER"/>
              <signal pad="PD5" function="A" group="GRX" index="0"/>
              <signal pad="PD6" function="A" group="GRX" index="0"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PD0" function="A" group="GTXCK"/>
              <signal pad="PD0" function="A" group="GREFCK"/>
              <signal pad="PD1" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD2" function="A" group="GTX" index="0"/>
              <signal pad="PD3" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" version="6378F">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" version="6449O">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40080000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA29" function="C" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" version="11227A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="11004N">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal pad="PA23" function="X1" group="PIODCCLK"/>
              <signal pad="PA24" function="X1" group="PIODC" index="0"/>
              <signal pad="PA25" function="X1" group="PIODC" index="1"/>
              <signal pad="PA26" function="X1" group="PIODC" index="2"/>
              <signal pad="PA27" function="X1" group="PIODC" index="3"/>
              <signal pad="PA28" function="X1" group="PIODC" index="4"/>
              <signal pad="PA29" function="X1" group="PIODC" index="5"/>
              <signal pad="PA31" function="X1" group="PIODC" index="7"/>
              <signal pad="PA30" function="X1" group="WKUP" index="11"/>
              <signal pad="PA30" function="X1" group="PIODC" index="6"/>
              <signal pad="PA15" function="X1" group="WKUP" index="14"/>
              <signal pad="PA15" function="X1" group="PIODCEN" index="1"/>
              <signal pad="PA16" function="X1" group="WKUP" index="15"/>
              <signal pad="PA16" function="X1" group="PIODCEN" index="2"/>
            </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
