Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E16C.xml
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="PMC" version="11116N">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343N">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40000000"/>
            <signals>
              <signal pad="PA9" function="C" group="PWMFI" index="0"/>
              <signal pad="PA0" function="A" group="PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PC18" function="B" group="PWMH" index="0"/>
              <signal pad="PD20" function="A" group="PWMH" index="0"/>
              <signal pad="PA1" function="A" group="PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PC19" function="B" group="PWMH" index="1"/>
              <signal pad="PD21" function="A" group="PWMH" index="1"/>
              <signal pad="PA2" function="A" group="PWMH" index="2"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMH" index="2"/>
              <signal pad="PC20" function="B" group="PWMH" index="2"/>
              <signal pad="PD22" function="A" group="PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PB14" function="B" group="PWMH" index="3"/>
              <signal pad="PC21" function="B" group="PWMH" index="3"/>
              <signal pad="PD23" function="A" group="PWMH" index="3"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWML" index="0"/>
              <signal pad="PC13" function="B" group="PWML" index="0"/>
              <signal pad="PD24" function="A" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PC1" function="B" group="PWML" index="1"/>
              <signal pad="PC15" function="B" group="PWML" index="1"/>
              <signal pad="PD25" function="A" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PC2" function="B" group="PWML" index="2"/>
              <signal pad="PD26" function="A" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
              <signal pad="PC3" function="B" group="PWML" index="3"/>
              <signal pad="PC22" function="B" group="PWML" index="3"/>
              <signal pad="PD27" function="A" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009F">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1800"/>
          </instance>
        </module>
        <module name="RSWDT" version="11110B">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x400E1900"/>
          </instance>
        </module>
        <module name="RTC" version="6056Q">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1860"/>
          </instance>
        </module>
        <module name="RTT" version="6081K">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1830"/>
          </instance>
        </module>
        <module name="SPI" version="6088Y">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40088000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA9" function="B" group="NPCS" index="1"/>
              <signal pad="PA31" function="A" group="NPCS" index="1"/>
              <signal pad="PB14" function="A" group="NPCS" index="1"/>
              <signal pad="PC4" function="B" group="NPCS" index="1"/>
              <signal pad="PA10" function="B" group="NPCS" index="2"/>
              <signal pad="PA30" function="B" group="NPCS" index="2"/>
              <signal pad="PB2" function="B" group="NPCS" index="2"/>
              <signal pad="PA3" function="B" group="NPCS" index="3"/>
              <signal pad="PA5" function="B" group="NPCS" index="3"/>
              <signal pad="PA22" function="B" group="NPCS" index="3"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="6452U">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1810"/>
