Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E16C.xml
        <register caption="Peripheral Clock Disable Register 1" name="PMC_PCDR1" offset="0x0104" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Disable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Disable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Disable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Disable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Disable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Disable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Disable" mask="0x00008000" name="PID47"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_PCSR1" offset="0x0108" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Status" mask="0x00008000" name="PID47"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR" offset="0x0110" rw="RW" size="4">
          <bitfield caption="RC Oscillator Calibration bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="RC Oscillator Calibration bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="RC Oscillator Calibration bits for 12 MHz" mask="0x007F0000" name="CAL12"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 12 MHz" mask="0x00800000" name="SEL12"/>
        </register>
        <register caption="PLL Maximum Multiplier Value Register" name="PMC_PMMR" offset="0x130" rw="RW" size="4">
          <bitfield caption="PLLA Maximum Allowed Multiplier Value" mask="0x000007FF" name="PLLA_MMAX"/>
        </register>
      </register-group>
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="The Fast RC Oscillator Frequency is at 4 MHz (default)" name="_4_MHz" value="0x0"/>
        <value caption="The Fast RC Oscillator Frequency is at 8 MHz" name="_8_MHz" value="0x1"/>
        <value caption="The Fast RC Oscillator Frequency is at 12 MHz" name="_12_MHz" value="0x2"/>
      </value-group>
      <value-group caption="" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_FSMR__FLPM">
        <value caption="Flash is in Standby Mode when system enters Wait Mode" name="FLASH_STANDBY" value="0x0"/>
        <value caption="Flash is in deep-power-down mode when system enters Wait Mode" name="FLASH_DEEP_POWERDOWN" value="0x1"/>
        <value caption="idle mode" name="FLASH_IDLE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" version="6343N">
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x000000FF" name="DIVA"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x00000F00" name="PREA"/>
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x00FF0000" name="DIVB"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x0F000000" name="PREB"/>
        </register>
