Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E16C.xml
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__SBSMPLR">
        <value caption="Load a Capture Register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture Register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture Register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture Register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture Register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
      <value-group caption="" name="TC_EMR0__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="" name="TC_EMR0__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="The trigger/capture input B is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__TCCLKS">
        <value caption="Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__SBSMPLR">
        <value caption="Load a Capture Register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture Register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture Register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture Register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture Register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
      <value-group caption="" name="TC_EMR1__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="" name="TC_EMR1__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="The trigger/capture input B is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__TCCLKS">
        <value caption="Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
